---
kind: property
id: P:Autodesk.Revit.DB.ViewSheetSet.Views
source: html/b6c69e58-9579-9df2-6adc-8f8ce44a633c.htm
---
# Autodesk.Revit.DB.ViewSheetSet.Views Property

The views.

## Syntax (C#)
```csharp
public virtual ViewSet Views { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - Thrown when the input views is Nothing nullptr a null reference ( Nothing in Visual Basic) .
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Thrown when the set operation failed due to invalid view which cannot be printed.